### Import the pandas

In [2]:
import pandas as pd

### Create a series object

In [4]:
s = pd.Series([78,23,11,45,3,69])

In [5]:
s

0    78
1    23
2    11
3    45
4     3
5    69
dtype: int64

In [6]:
s.size

6

In [8]:
s[3]

45

In [9]:
langs = pd.Series(['Bengali','Marathi','Kannada','Telugu','Tamil'])

In [10]:
langs

0    Bengali
1    Marathi
2    Kannada
3     Telugu
4      Tamil
dtype: object

In [12]:
langs[3]

'Telugu'

In [13]:
langs.dtype

dtype('O')

### DataFrame

In [16]:
roll = pd.Series([1,2,3,4,5])
name = pd.Series(['Priya','Rani','Pramod','Rashmi','Anita'])
marks = pd.Series([67.88, 89.66, 48.90, 56.78, 65.78])

In [17]:
df = pd.DataFrame({
    'Roll': roll,
    'Name': name,
    'Marks': marks
})

In [18]:
df

   Roll    Name  Marks
0     1   Priya  67.88
1     2    Rani  89.66
2     3  Pramod  48.90
3     4  Rashmi  56.78
4     5   Anita  65.78

In [19]:
df.shape

(5, 3)

In [20]:
df.size

15

In [21]:
df.dtypes

Roll       int64
Name      object
Marks    float64
dtype: object

In [22]:
# https://mitu.co.in/dataset

In [23]:
import os
os.getcwd()

'/home/mitu'

In [32]:
os.listdir();

### Read the dataset

In [30]:
df = pd.read_csv('student.csv')

In [31]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [33]:
df.shape

(10, 5)

In [34]:
df.size

50

In [35]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [36]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [37]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [38]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [39]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [ ]:
df.info()

In [ ]:
df.describe()

### Slicing of data

#### Index based slicing

In [43]:
x = df.iloc[2:8,1:4]
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [44]:
df.iloc[:8,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [45]:
df.iloc[:8,1:]

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23

In [46]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [47]:
df.iloc[7,:]

roll         8
name     amita
class       BE
marks    68.33
age         23
Name: 7, dtype: object

In [48]:
df.iloc[7,1:4]

name     amita
class       BE
marks    68.33
Name: 7, dtype: object

In [49]:
df.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [51]:
df.iloc[[4,6,8,9],[1,3,4]]

    name  marks  age
4   asha  63.28   20
6   amar  65.34   19
8   amol  56.75   20
9  anmol  78.66   21

#### label based slicing

In [54]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [55]:
df.loc[:,['name','class']]

      name class
0     anil    TE
1     amit    TE
2   aniket    BE
3  ajinkya    TE
4     asha    TE
5   ayesha    BE
6     amar    BE
7    amita    BE
8     amol    TE
9    anmol    BE

In [56]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [57]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [58]:
import pandas as pd

In [59]:
df = pd.read_csv('student.csv')

In [60]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [61]:
x = df.iloc[6,2]
x

'BE'

In [63]:
x = df[['name','marks']]
type(x)

pandas.core.frame.DataFrame

In [64]:
x = df['name']
type(x)

pandas.core.series.Series

### Delete the row / column from this dataframe

In [66]:
df.drop(4)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [67]:
df.drop([2,6,9])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [68]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [69]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [70]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [71]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [72]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [73]:
df.median()

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [75]:
df['age'].mode()

0    20
dtype: int64

In [76]:
df['class'].mode()

0    BE
1    TE
dtype: object

In [77]:
df['name'].max()

'ayesha'

In [78]:
df['name'].min()

'ajinkya'

### Rename the columns

In [80]:
df.rename(columns={'roll':'id','class':'year','marks':'CGPA'})

   id     name year   CGPA  age
0   1     anil   TE  56.77   22
1   2     amit   TE  59.77   21
2   3   aniket   BE  76.88   19
3   4  ajinkya   TE  69.66   20
4   5     asha   TE  63.28   20
5   6   ayesha   BE  49.55   20
6   7     amar   BE  65.34   19
7   8    amita   BE  68.33   23
8   9     amol   TE  56.75   20
9  10    anmol   BE  78.66   21

### Rename the index / row number

In [83]:
df.rename(index={0:'Zero',5:'Five',9:'Nine'})

      roll     name class  marks  age
Zero     1     anil    TE  56.77   22
1        2     amit    TE  59.77   21
2        3   aniket    BE  76.88   19
3        4  ajinkya    TE  69.66   20
4        5     asha    TE  63.28   20
Five     6   ayesha    BE  49.55   20
6        7     amar    BE  65.34   19
7        8    amita    BE  68.33   23
8        9     amol    TE  56.75   20
Nine    10    anmol    BE  78.66   21

In [84]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [85]:
x = ['Male','Male','Male','Male','Female','Female',
     'Male','Female','Male','Male']

In [86]:
x

['Male',
 'Male',
 'Male',
 'Male',
 'Female',
 'Female',
 'Male',
 'Female',
 'Male',
 'Male']

In [87]:
df['gender'] = x

In [88]:
df

   roll     name class  marks  age  gender
0     1     anil    TE  56.77   22    Male
1     2     amit    TE  59.77   21    Male
2     3   aniket    BE  76.88   19    Male
3     4  ajinkya    TE  69.66   20    Male
4     5     asha    TE  63.28   20  Female
5     6   ayesha    BE  49.55   20  Female
6     7     amar    BE  65.34   19    Male
7     8    amita    BE  68.33   23  Female
8     9     amol    TE  56.75   20    Male
9    10    anmol    BE  78.66   21    Male

In [89]:
df.dtypes

roll        int64
name       object
class      object
marks     float64
age         int64
gender     object
dtype: object

In [90]:
df['marks'] + 0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [91]:
df['marks'] = df['marks'] + 0.5

In [92]:
df

   roll     name class  marks  age  gender
0     1     anil    TE  57.27   22    Male
1     2     amit    TE  60.27   21    Male
2     3   aniket    BE  77.38   19    Male
3     4  ajinkya    TE  70.16   20    Male
4     5     asha    TE  63.78   20  Female
5     6   ayesha    BE  50.05   20  Female
6     7     amar    BE  65.84   19    Male
7     8    amita    BE  68.83   23  Female
8     9     amol    TE  57.25   20    Male
9    10    anmol    BE  79.16   21    Male

In [93]:
# A101

In [94]:
add = lambda x: 'A' + str(100+x)

In [97]:
add(7)

'A107'

In [99]:
df['roll'] = df['roll'].apply(lambda x: 'A' + str(100+x))

In [100]:
df

   roll     name class  marks  age  gender
0  A101     anil    TE  57.27   22    Male
1  A102     amit    TE  60.27   21    Male
2  A103   aniket    BE  77.38   19    Male
3  A104  ajinkya    TE  70.16   20    Male
4  A105     asha    TE  63.78   20  Female
5  A106   ayesha    BE  50.05   20  Female
6  A107     amar    BE  65.84   19    Male
7  A108    amita    BE  68.83   23  Female
8  A109     amol    TE  57.25   20    Male
9  A110    anmol    BE  79.16   21    Male

In [101]:
df['gender'].value_counts()

Male      7
Female    3
Name: gender, dtype: int64

In [102]:
df['class'].value_counts()

BE    5
TE    5
Name: class, dtype: int64

In [103]:
df['age'].value_counts()

20    4
21    2
19    2
23    1
22    1
Name: age, dtype: int64

### Iterate the Dataframe

In [105]:
for x in df:
    print(x)

roll
name
class
marks
age
gender

In [106]:
for x in df:
    print(df[x])

0    A101
1    A102
2    A103
3    A104
4    A105
5    A106
6    A107
7    A108
8    A109
9    A110
Name: roll, dtype: object
0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object
0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object
0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64
0    22
1    21
2    19
3    20
4    20
5    20
6    19
7    23
8    20
9    21
Name: age, dtype: int64
0      Male
1      Male
2      Male
3      Male
4    Female
5    Female
6      Male
7    Female
8      Male
9      Male
Name: gender, dtype: object

### Sort the data

In [108]:
df.sort_values(by='class')

   roll     name class  marks  age  gender
2  A103   aniket    BE  77.38   19    Male
5  A106   ayesha    BE  50.05   20  Female
6  A107     amar    BE  65.84   19    Male
7  A108    amita    BE  68.83   23  Female
9  A110    anmol    BE  79.16   21    Male
0  A101     anil    TE  57.27   22    Male
1  A102     amit    TE  60.27   21    Male
3  A104  ajinkya    TE  70.16   20    Male
4  A105     asha    TE  63.78   20  Female
8  A109     amol    TE  57.25   20    Male

In [109]:
df.sort_values(by=['class','gender'])

   roll     name class  marks  age  gender
5  A106   ayesha    BE  50.05   20  Female
7  A108    amita    BE  68.83   23  Female
2  A103   aniket    BE  77.38   19    Male
6  A107     amar    BE  65.84   19    Male
9  A110    anmol    BE  79.16   21    Male
4  A105     asha    TE  63.78   20  Female
0  A101     anil    TE  57.27   22    Male
1  A102     amit    TE  60.27   21    Male
3  A104  ajinkya    TE  70.16   20    Male
8  A109     amol    TE  57.25   20    Male

In [110]:
df.sort_values(by=['class','gender','marks'])

   roll     name class  marks  age  gender
5  A106   ayesha    BE  50.05   20  Female
7  A108    amita    BE  68.83   23  Female
6  A107     amar    BE  65.84   19    Male
2  A103   aniket    BE  77.38   19    Male
9  A110    anmol    BE  79.16   21    Male
4  A105     asha    TE  63.78   20  Female
8  A109     amol    TE  57.25   20    Male
0  A101     anil    TE  57.27   22    Male
1  A102     amit    TE  60.27   21    Male
3  A104  ajinkya    TE  70.16   20    Male

In [111]:
df.sort_values(by=['class','gender'], ascending=False)

   roll     name class  marks  age  gender
0  A101     anil    TE  57.27   22    Male
1  A102     amit    TE  60.27   21    Male
3  A104  ajinkya    TE  70.16   20    Male
8  A109     amol    TE  57.25   20    Male
4  A105     asha    TE  63.78   20  Female
2  A103   aniket    BE  77.38   19    Male
6  A107     amar    BE  65.84   19    Male
9  A110    anmol    BE  79.16   21    Male
5  A106   ayesha    BE  50.05   20  Female
7  A108    amita    BE  68.83   23  Female

### String operations

In [113]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [114]:
df['name'].str.lower()

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [115]:
df['name'].str.swapcase()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [116]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [117]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [118]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [119]:
df['name'].str.islower()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

In [121]:
df['name'].str.contains('m')

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
Name: name, dtype: bool

In [122]:
df['name'].str.len()

0    4
1    4
2    6
3    7
4    4
5    6
6    4
7    5
8    4
9    5
Name: name, dtype: int64

In [123]:
df['name'].str.count('a')

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [124]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [128]:
df['name'].str.find('a')

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
Name: name, dtype: int64

In [126]:
df['name'].str.repeat(4)

0                anilanilanilanil
1                amitamitamitamit
2        aniketaniketaniketaniket
3    ajinkyaajinkyaajinkyaajinkya
4                ashaashaashaasha
5        ayeshaayeshaayeshaayesha
6                amaramaramaramar
7            amitaamitaamitaamita
8                amolamolamolamol
9            anmolanmolanmolanmol
Name: name, dtype: object

### Boolean filtering

In [130]:
mask = df['marks'] > 60

In [131]:
mask

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [132]:
df[mask]

   roll     name class  marks  age  gender
1  A102     amit    TE  60.27   21    Male
2  A103   aniket    BE  77.38   19    Male
3  A104  ajinkya    TE  70.16   20    Male
4  A105     asha    TE  63.78   20  Female
6  A107     amar    BE  65.84   19    Male
7  A108    amita    BE  68.83   23  Female
9  A110    anmol    BE  79.16   21    Male

In [133]:
df[df['marks'] > 60]

   roll     name class  marks  age  gender
1  A102     amit    TE  60.27   21    Male
2  A103   aniket    BE  77.38   19    Male
3  A104  ajinkya    TE  70.16   20    Male
4  A105     asha    TE  63.78   20  Female
6  A107     amar    BE  65.84   19    Male
7  A108    amita    BE  68.83   23  Female
9  A110    anmol    BE  79.16   21    Male

In [134]:
df[(df['marks'] > 60) & (df['class'] == 'BE')]

   roll    name class  marks  age  gender
2  A103  aniket    BE  77.38   19    Male
6  A107    amar    BE  65.84   19    Male
7  A108   amita    BE  68.83   23  Female
9  A110   anmol    BE  79.16   21    Male

In [135]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age gender
0  A101    anil    TE  57.27   22   Male
2  A103  aniket    BE  77.38   19   Male
9  A110   anmol    BE  79.16   21   Male

In [136]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [137]:
x

   roll    name class  marks  age  gender
2  A103  aniket    BE  77.38   19    Male
6  A107    amar    BE  65.84   19    Male
7  A108   amita    BE  68.83   23  Female
9  A110   anmol    BE  79.16   21    Male

### Export the data

In [139]:
x.to_csv('output.csv', index=False)

In [140]:
x.to_html('output.html', index=False)

### Grouping the data

In [142]:
grouped = df.groupby('class')

In [144]:
grouped.get_group('TE')

   roll     name class  marks  age  gender
0  A101     anil    TE  57.27   22    Male
1  A102     amit    TE  60.27   21    Male
3  A104  ajinkya    TE  70.16   20    Male
4  A105     asha    TE  63.78   20  Female
8  A109     amol    TE  57.25   20    Male

In [145]:
grouped = df.groupby('gender')
grouped.get_group('Male')

   roll     name class  marks  age gender
0  A101     anil    TE  57.27   22   Male
1  A102     amit    TE  60.27   21   Male
2  A103   aniket    BE  77.38   19   Male
3  A104  ajinkya    TE  70.16   20   Male
6  A107     amar    BE  65.84   19   Male
8  A109     amol    TE  57.25   20   Male
9  A110    anmol    BE  79.16   21   Male

In [146]:
import numpy as np

In [147]:
grouped['marks'].agg(np.mean)

gender
Female    60.886667
Male      66.761429
Name: marks, dtype: float64

In [149]:
grouped['age'].agg(max)

gender
Female    23
Male      22
Name: age, dtype: int64